import java.io.IOException;
import java.nio.file.Files;
import java.nio.file.Path;
import java.util.Scanner;
public class Dramadatabase {
	public static void main(String[] args){
		//変数, 配列の準備
		int[] ids={2024,2023,2022,2021,2020};
		String[] names={"放課後カルテ","VIVANT"};
		String[] monogatari={"物語は、小学校を舞台に、口も態度もでかい小児科医・牧野が、その観察眼で”言葉にできないSOS”を見抜き、未来へ向かう子どもたちの背中を押す。","物語は、大手商社「丸菱商事」の社員である乃木憂助(堺雅人)が、所属部署で発生したご送金事件の損失を回収するために中央アジアのバルカ共和国へ向かうところから始まります。現地では爆破事件の容疑者として追われる中、お金の受取人が口にした「ヴィヴァン」の謎に迫っていく--。"};
		String[] Jyannru={"ヒューマン/医療","アドベンチャー"};
		String[] kansou={"ストーリーは興味深く面白い。そして、回を重ねるたびに深みが増してくる。小学生の悩み、友情、主人公(牧野先生)の成長、丁寧に描かれている、宙わたる教室と並んで良い作品。","最初から最後まで期待を裏切らないような展開が何度も続いて気がついたら見終わってた。騙し騙されが色んな場面でおきてて途中で飽きる要素はなかった。全く想像のつかない人物が実は、、本当に最後の最後まで展開が読めないので個人的にはかなりドキドキハラハラする作品でした。"};
		String[] kantoku={"鈴木勇馬","福澤克雄"};
		String[] syuenn={"松下洸平","堺雅人"};
		String[] syutuensha={"森川葵/ホラン千秋/加藤千尋/高野洸/ソニン/塚本高史/武田真一/六角慎司/平岡祐太/吉沢悠/田辺誠一","阿部寛/二階堂ふみ/竜星 涼/追田孝也/飯沼愛/山中 崇/河内大和/馬場 徹/Barslknagva Batbold/Tsaschikher Khatanzorig/Nandin-Erdene Khongorzul/渡辺邦斗/古屋呂敏/内野謙太/富栄ドラム/林原めぐみ/二宮和也/櫻井海音/Martin Starr/Erkhembayar Ganbold/真凛/水谷果穂/井上順/林 遺都/高梨 臨/林 秦文/吉原光夫/内村 遥/井上 "};
		String[] syudaika={"waacci「どんな小さな」"};
		String[] saito={"https://www.ntv.co.jp/houkagokarte/chart/","https://www.tbs.co.jp/VIVANT_tbs/"};
		int i;
		//検索値の入力(スキャナの準備)
		System.out.println("入力された放送年からドラマタイトルを検索します");
		Scanner sc = new Scanner(System.in);
		System.out.println("ドラマの放送開始年を入力してください");
		int n = sc.nextInt();
		if(n==0){
		  return;
		}
		//検索
		for(i=0;i<ids.length;i++){
			if(n==ids[i]) break;  // {} 波括弧は省略
		}
		//表示
		if(i==ids.length){     //ループが回りきって終了した場合
			System.out.println();
		}else{              //ループがbreakで終了した場合
		    System.out.println("=====================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================-===========");
		    System.out.println(""+n+"年に放送された「"+names[i]+"」＜この物語は、"+monogatari[i]);
		    System.out.println("このドラマのジャンル>>>>>>>「"+Jyannru[i]+"」");
		    System.out.println("視聴した感想>>>>>>>>>>>"+kansou[i]+"");
		    System.out.println("監督>>>>>>>>「"+kantoku[i]+"」");
		    System.out.println("主演>>>>>>>>「"+syuenn[i]+"」");
		    System.out.println("出演者>>>>>> 「"+syutuensha[i]+"」");
		    System.out.println("主題歌>>>>>>>>「"+syudaika[i]+"」");
		    System.out.println("サイト>>>>>>>> 「"+saito[i]+"」");
		    System.out.println("===================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================");
		    String message1 = "ドラマ名・・「"+names[i]+"」<この物語は、"+monogatari[i];
		    String message2 = "ジャンル・・「"+Jyannru[i]+"」 感想・・・ "+kansou[i]+"監督・・・「"+kantoku[i]+"";
		 // 文字列を繋げて、保存用のデータをつくります
		 // "\n" は改行記号です。
		    String savedata = message1 + "\n" + message2;
		 try {
			// プロジェクトフォルダの data.txt というファイルに
			// データを保存します。
			 Files.writeString(Path.of("./data.txt"), savedata);
		 } catch (IOException err) {
			 err.printStackTrace();
		 }
		 }
     }
}